In [ ]:
!pip install pymysql

In [2]:
import pymysql.cursors
import pandas as pd

In [3]:
HOST = '35.200.30.86' #본인 GCP의 외부 IP 주소 ex) 192.0.0.1
USER = 'root' #본인이 생성한 mysql 계정
PASSWORD = 'mysql' #비밀번호

In [4]:
try:
    conn = pymysql.connect(host=HOST,
        user=USER,
        password=PASSWORD,
        charset='utf8mb4')
    
    with conn.cursor() as cursor:
        sql = 'SHOW DATABASES'
        cursor.execute(sql)
        result = cursor.fetchall()
        print(result)
finally:
    conn.close()

(('information_schema',), ('DRUGSTROE',), ('DSLAB',), ('DSLAB3',), ('DSLAB4',), ('dslab',), ('mysql',), ('performance_schema',), ('sys',), ('testdatabase',))

In [5]:
try:
    conn = pymysql.connect(host=HOST,
        user=USER,
        password=PASSWORD,
        db='DSLAB',
        charset='utf8mb4')
    
    with conn.cursor() as cursor:
        sql = 'Select * from EMP'
        cursor.execute(sql)
        result = cursor.fetchall()
        print(result)
finally:
    conn.close()

((Decimal('7369'), 'SMITH', 'CLERK', Decimal('7902'), datetime.date(1980, 12, 17), Decimal('800.00'), None, Decimal('20')), (Decimal('7499'), 'ALLEN', 'SALESMAN', Decimal('7698'), datetime.date(1981, 2, 20), Decimal('1600.00'), Decimal('300.00'), Decimal('30')), (Decimal('7521'), 'WARD', 'SALESMAN', Decimal('7698'), datetime.date(1981, 2, 22), Decimal('1250.00'), Decimal('500.00'), Decimal('30')), (Decimal('7566'), 'JONES', 'MANAGER', Decimal('7839'), datetime.date(1981, 4, 2), Decimal('2975.00'), None, Decimal('20')), (Decimal('7654'), 'MARTIN', 'SALESMAN', Decimal('7698'), datetime.date(1981, 9, 28), Decimal('1250.00'), Decimal('1400.00'), Decimal('30')), (Decimal('7698'), 'BLAKE', 'MANAGER', Decimal('7839'), datetime.date(1981, 5, 1), Decimal('2850.00'), None, Decimal('30')), (Decimal('7782'), 'CLARK', 'MANAGER', Decimal('7839'), datetime.date(1981, 6, 9), Decimal('2450.00'), None, Decimal('10')), (Decimal('7788'), 'SCOTT', 'ANALYST', Decimal('7566'), datetime.date(1987, 6, 28), Decimal('3000.00'), None, Decimal('20')), (Decimal('7839'), 'KING', 'PRESIDENT', None, datetime.date(1981, 11, 17), Decimal('5000.00'), None, Decimal('10')), (Decimal('7844'), 'TURNER', 'SALESMAN', Decimal('7698'), datetime.date(1981, 9, 8), Decimal('1500.00'), Decimal('0.00'), Decimal('30')), (Decimal('7876'), 'ADAMS', 'CLERK', Decimal('7788'), datetime.date(1987, 7, 13), Decimal('1100.00'), None, Decimal('20')), (Decimal('7900'), 'JAMES', 'CLERK', Decimal('7698'), datetime.date(1981, 12, 3), Decimal('950.00'), None, Decimal('30')), (Decimal('7902'), 'FORD', 'ANALYST', Decimal('7566'), datetime.date(1981, 12, 3), Decimal('3000.00'), None, Decimal('20')), (Decimal('7934'), 'MILLER', 'CLERK', Decimal('7782'), datetime.date(1982, 1, 23), Decimal('1300.00'), None, Decimal('10')))

In [12]:
try:
    conn = pymysql.connect(host=HOST,
        user=USER,
        password=PASSWORD,
        db='DSLAB',
        charset='utf8mb4')
    sql_for_df = '''SELECT E.ENAME,D.DNAME 
    FROM EMP E,DEPT D WHERE E.DEPTNO = D.DEPTNO
    AND D.DEPTNO = 10;'''
    df_from_database = pd.read_sql(sql_for_df , conn)
finally:
    conn.close()
df_from_database

    ENAME       DNAME
0   CLARK  ACCOUNTING
1    KING  ACCOUNTING
2  MILLER  ACCOUNTING

In [13]:
try:
    conn = pymysql.connect(host=HOST,
        user=USER,
        password=PASSWORD,
        db='DSLAB',
        charset='utf8mb4')
    sql_for_df = '''SELECT EMPNO,ENAME,SAL
FROM EMP
WHERE SAL > (SELECT AVG(SAL)
          FROM EMP)
ORDER BY SAL DESC;'''
    df_from_database = pd.read_sql(sql_for_df , conn)
finally:
    conn.close()
df_from_database

    EMPNO  ENAME     SAL
0  7839.0   KING  5000.0
1  7788.0  SCOTT  3000.0
2  7902.0   FORD  3000.0
3  7566.0  JONES  2975.0
4  7698.0  BLAKE  2850.0
5  7782.0  CLARK  2450.0

In [14]:
try:
    conn = pymysql.connect(host=HOST,
        user=USER,
        password=PASSWORD,
        db='DSLAB',
        charset='utf8mb4')
    sql_for_df = '''SELECT EMPNO,ENAME
        FROM EMP
        WHERE SAL = (SELECT MAX(SAL) 
         FROM EMP 
         WHERE DEPTNO = 10);'''
    df_from_database = pd.read_sql(sql_for_df , conn)
finally:
    conn.close()
df_from_database

    EMPNO ENAME
0  7839.0  KING